<?php 
// +----------------------------------------------------------------------
// | Copyright (c) 2018 http://www.restfulapi.cn All rights reserved.
// +----------------------------------------------------------------------
// | Author: ngtwewy <62006464@qq.com> 
// +----------------------------------------------------------------------
// | DateTime: 2018-10-22
// +----------------------------------------------------------------------


return [
    "per_page"          => 10, 
    "item_per_page"     => 10, // 每页显示的条数
    "comments_per_page" => 10, // 评论每页显示的条数
    "post_is_show"      => true,    // 发布文章是否需要审核


    "post-article-article-add" => 500

];
