<?php
// +----------------------------------------------------------------------
// | Copyright (c) 2020 http://restfulapi.cn All rights reserved.
// +----------------------------------------------------------------------
// | Author: ngtwewy <62006464@qq.com> 
// +----------------------------------------------------------------------
// | DateTime: 2020-02-20
// +----------------------------------------------------------------------


return [
    // // 验证码设置
    // 'code' => [
    //     'is_send'        => false, // 测试用，不发验证码的话，在返回的json包含验证码
    //     'expire_minute'  => 30, // 验证码有效时间，单位分钟，建议5-30分钟
    //     'limit_per_day'  => 6 // 每个IP地址，一天内可以获取的验证码的次数
    // ], 

    // // 短信验证码
    // 'sms' => [
    //     'yunpian' => [  //yunpian.com
    //         'api_key'          => "", //apikey官网后获取
    //         'template_content' => "#code#。如非本人操作，请忽略本短信",
    //         'template_id'      => "",
    //     ]
    // ],

    // // 邮件验证码
    // 'email' => [
    //     'host'      => 'smtp.qq.com',
    //     'username'  => '123123@qq.com',
    //     'password'  => '',
    //     'port'      => '25',
    //     'from'      => '', //邮件发送者的名字
    //     'subject'   => '你的验证码是:#code#', //标题
    //     'body'      => '
    //         你好，
    //         验证码：#code#，该验证码30分钟内有效。为了保障您的账户安全，请勿向他人泄漏验证码信息。<br/>
    //         如非你本人操作，请忽略此邮件。<br/><br/>
    //         此致<br/>
    //         API 罐头<br/> 
    //     '
    // ]
];


